{
  "rivers": [
    {
      "name": "Amazon River",
      "length": 6575,
      "length_unit": "kilometers",
      "location": "South America",
      "fact": "The Amazon River is the largest river by water volume in the world and is home to diverse ecosystems."
    },
    {
      "name": "Nile River",
      "length": 6650,
      "length_unit": "kilometers",
      "location": "Africa",
      "fact": "The Nile is often considered the longest river in the world and was crucial to the development of ancient Egyptian civilization."
    },
    {
      "name": "Yangtze River",
      "length": 6300,
      "length_unit": "kilometers",
      "location": "China",
      "fact": "The Yangtze River is the longest river in Asia and is home to several endangered species, including the Chinese alligator."
    },
    {
      "name": "Mississippi River",
      "length": 3766,
      "length_unit": "kilometers",
      "location": "United States",
      "fact": "The Mississippi River is the second-longest river in North America and has played a significant role in American history and commerce."
    },
    {
      "name": "Yenisei River",
      "length": 5539,
      "length_unit": "kilometers",
      "location": "Russia",
      "fact": "The Yenisei River is the largest river system flowing to the Arctic Ocean and is an important transportation route in Siberia."
    },
    {
      "name": "Congo River",
      "length": 4700,
      "length_unit": "kilometers",
      "location": "Africa",
      "fact": "The Congo River is the second-longest river in Africa and is known for its deep waters and powerful rapids."
    },
    {
      "name": "Mekong River",
      "length": 4350,
      "length_unit": "kilometers",
      "location": "Southeast Asia",
      "fact": "The Mekong River flows through six countries and is crucial for agriculture and fisheries in the region."
    }
  ],
  "items": [
    {
      "name": "Skittle",
      "length": 0.015,
      "length_unit": "meters",
      "fact": "Skittles were first produced in the 1970s in the United Kingdom and have a distinctive fruity flavor."
    },
    {
      "name": "Hot Dog",
      "length": 0.15,
      "length_unit": "meters",
      "fact": "Hot dogs, also known as frankfurters, are named after Frankfurt, Germany, where they originated."
    },
    {
      "name": "Foot-Long Hot Dog",
      "length": 0.305,
      "length_unit": "meters",
      "fact": "The foot-long hot dog is a popular American food item, often served at sporting events and barbecues."
    },
    {
      "name": "Matchbox Car",
      "length": 0.075,
      "length_unit": "meters",
      "fact": "Matchbox cars were first introduced in 1953 and are known for their detailed miniature models of real vehicles."
    },
    {
      "name": "Statue of Liberty",
      "length": 93,
      "length_unit": "meters",
      "fact": "The Statue of Liberty was a gift from France to the United States and was dedicated on October 28, 1886."
    },
    {
      "name": "Deepest Part of the Ocean (Mariana Trench)",
      "length": 10994,
      "length_unit": "meters",
      "fact": "The Mariana Trench is the deepest part of the world's oceans and reaches a depth of about 11,000 meters."
    },
    {
      "name": "50-Inch TV (Length of Widescreen TV)",
      "length": 1.11,
      "length_unit": "meters",
      "fact": "A 50-inch TV has become a standard size for large home entertainment screens, offering a cinematic experience."
    },
    {
      "name": "Marathon",
      "length": 42195,
      "length_unit": "meters",
      "fact": "A marathon is a long-distance running event with a standard length of 42.195 kilometers, originating from the ancient Greek marathon run."
    },
    {
      "name": "Ham",
      "length": 0.25,
      "length_unit": "meters",
      "fact": "Ham is a type of processed meat that comes from the hind leg of a pig and has been a staple in many cultures for centuries."
    },
    {
      "name": "Shortest Mountain (Mount Wycheproof)",
      "length": 0.043,
      "length_unit": "meters",
      "fact": "Mount Wycheproof in Australia is considered the world's shortest mountain, with a length of just 148 meters."
    },
    {
      "name": "Dr. Pepper Can",
      "length": 0.12,
      "length_unit": "meters",
      "fact": "A standard Dr. Pepper can holds 355 milliliters of soda and is known for its unique blend of 23 flavors."
    }
  ]
}
